In [1]:
# importing  pandas library
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series(np.array(np.arange(1,10,2)))
obj

0    1
1    3
2    5
3    7
4    9
dtype: int32

In [3]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
obj.values

array([1, 3, 5, 7, 9])

In [5]:
obj2 = pd.Series([13,4,5],index=['d','a','e'])
obj2

d    13
a     4
e     5
dtype: int64

In [6]:
obj2.index

Index(['d', 'a', 'e'], dtype='object')

In [7]:
obj2.values

array([13,  4,  5], dtype=int64)

In [8]:
obj2['d']

13

In [9]:
obj2['a'] = 6

In [10]:
obj2

d    13
a     6
e     5
dtype: int64

In [11]:
obj2[obj2 > 2]

d    13
a     6
e     5
dtype: int64

In [12]:
obj2[obj2 > 2].sum()

24

In [13]:
max(obj2[obj2>2])

13

In [14]:
'a' in obj2

True

In [15]:
4 in obj2

False

In [16]:
sdata = {'ohio': 3500,'texas':5687,'oregon':4834,'utah':5799}
sdata

{'ohio': 3500, 'texas': 5687, 'oregon': 4834, 'utah': 5799}

In [17]:
pd.Series(sdata)

ohio      3500
texas     5687
oregon    4834
utah      5799
dtype: int64

In [18]:
states = ['california','ohio',"oregon",'utah']
obj4 = pd.Series(sdata,index=states)
obj4

california       NaN
ohio          3500.0
oregon        4834.0
utah          5799.0
dtype: float64

In [19]:
obj4[obj4 > 200].mean()

4711.0

In [20]:
pd.isnull(obj4)

california     True
ohio          False
oregon        False
utah          False
dtype: bool

In [21]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
utah           True
dtype: bool

In [22]:
pd.notna(obj4)

california    False
ohio           True
oregon         True
utah           True
dtype: bool

In [23]:
obj3 = pd.Series(sdata)
obj3

ohio      3500
texas     5687
oregon    4834
utah      5799
dtype: int64

In [24]:
obj4

california       NaN
ohio          3500.0
oregon        4834.0
utah          5799.0
dtype: float64

In [25]:
obj3+obj4

california        NaN
ohio           7000.0
oregon         9668.0
texas             NaN
utah          11598.0
dtype: float64

In [26]:
obj4.name = 'population'

In [27]:
obj4

california       NaN
ohio          3500.0
oregon        4834.0
utah          5799.0
Name: population, dtype: float64

In [28]:
obj4.index.name = 'state'
obj4

state
california       NaN
ohio          3500.0
oregon        4834.0
utah          5799.0
Name: population, dtype: float64

In [29]:
pd.DataFrame(obj4)

            population
state
california         NaN
ohio            3500.0
oregon          4834.0
utah            5799.0

### DataFrame

In [32]:
data = {'state':['ohia','ohia','ohia','nevada','nevada','nevada'],
         'year':[2000,2001,2003,34004,34324,3534],
          'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [34]:
frame = pd.DataFrame(data)

In [35]:
frame.name = 'information'

In [36]:
frame

    state   year  pop
0    ohia   2000  1.5
1    ohia   2001  1.7
2    ohia   2003  3.6
3  nevada  34004  2.4
4  nevada  34324  2.9
5  nevada   3534  3.2

In [37]:
frame.index.name = 'serial number'
frame

                state   year  pop
serial number
0                ohia   2000  1.5
1                ohia   2001  1.7
2                ohia   2003  3.6
3              nevada  34004  2.4
4              nevada  34324  2.9
5              nevada   3534  3.2

In [38]:
frame.head(2)

              state  year  pop
serial number
0              ohia  2000  1.5
1              ohia  2001  1.7

In [43]:
# Change the order of columns with respec to it's values
frameUpadate = pd.DataFrame(data,columns=['year','state','pop'])

In [44]:
frameUpadate.index.name = 'serial number'

In [45]:
frameUpadate

                year   state  pop
serial number
0               2000    ohia  1.5
1               2001    ohia  1.7
2               2003    ohia  3.6
3              34004  nevada  2.4
4              34324  nevada  2.9
5               3534  nevada  3.2

In [52]:
frameUpadate[frameUpadate['year'] > 2001]

                year   state  pop
serial number
2               2003    ohia  3.6
3              34004  nevada  2.4
4              34324  nevada  2.9
5               3534  nevada  3.2

In [ ]:
Imp